{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "LSTM", "config": {"inner_init": "orthogonal", "b_regularizer": null, "return_sequences": false, "output_dim": 512, "dropout_U": 0.0, "forget_bias_init": "one", "batch_input_shape": [null, 50, 39], "trainable": true, "U_regularizer": null, "stateful": false, "name": "lstm_1", "input_length": null, "W_regularizer": null, "init": "glorot_uniform", "go_backwards": false, "unroll": false, "input_dim": 39, "dropout_W": 0.0, "input_dtype": "float32", "activation": "tanh", "inner_activation": "hard_sigmoid", "consume_less": "cpu"}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "bias": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 39, "activation": "linear", "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}]}